In [1]:
import numpy  as np
import pandas as pd

In [2]:
# read Excel table
table_init = pd.read_excel("Assets20210511.xls")

tindex   = pd.RangeIndex(start=3, stop=90, step=1)
tcolumns = ["Unnamed: 1", "Unnamed: 2"]

t = pd.DataFrame(table_init, index=tindex, columns=tcolumns)
print (t)

   Unnamed: 1  Unnamed: 2
3         AMD     5431.60
4      Etalon     4636.00
5    Infineon     2772.00
6     Mail.ru     3150.00
7   Polimetal     3343.00
..        ...         ...
85      Рубли    36320.00
86          $      566.00
87       Евро       77.00
88        NaN         NaN
89        NaN   441275.88

[87 rows x 2 columns]

In [3]:
tindex   = pd.RangeIndex(start=3, stop=90, step=1)
tcolumns = ["Unnamed: 1", "Unnamed: 2"]

t = pd.DataFrame(table_init, index=tindex, columns=tcolumns)
t.tail(5)             # last 5 elements

   Unnamed: 1  Unnamed: 2
85      Рубли    36320.00
86          $      566.00
87       Евро       77.00
88        NaN         NaN
89        NaN   441275.88

In [4]:
t.head(5)             # first 5 elements

  Unnamed: 1  Unnamed: 2
3        AMD      5431.6
4     Etalon      4636.0
5   Infineon      2772.0
6    Mail.ru      3150.0
7  Polimetal      3343.0

In [5]:
t.columns

Index(['Unnamed: 1', 'Unnamed: 2'], dtype='object')

In [6]:
# dimension of the table
t.shape    # dimension of the table

(87, 2)

In [7]:
t.iloc[-1]  # last line

Unnamed: 1          NaN
Unnamed: 2    441275.88
Name: 89, dtype: object

In [8]:
t.iloc[0]   # first line

Unnamed: 1       AMD
Unnamed: 2    5431.6
Name: 3, dtype: object

In [9]:
t.iloc[2,1] # 3-rd line & 2-nd column value

2772.0

In [10]:
t.loc[3, "Unnamed: 2"] # line "3" & column "Unnamed: 2"

5431.6

In [11]:
t.iloc[0:5,0]

3          AMD
4       Etalon
5     Infineon
6      Mail.ru
7    Polimetal
Name: Unnamed: 1, dtype: object

In [12]:
t.iloc[0:5,1]

3    5431.6
4    4636.0
5    2772.0
6    3150.0
7    3343.0
Name: Unnamed: 2, dtype: float64

In [13]:
t.iloc[0:5,0:1]

  Unnamed: 1
3        AMD
4     Etalon
5   Infineon
6    Mail.ru
7  Polimetal

In [14]:
t.loc[0:5]

  Unnamed: 1  Unnamed: 2
3        AMD      5431.6
4     Etalon      4636.0
5   Infineon      2772.0

In [15]:
t.loc[0:5, "Unnamed: 1":"Unnamed: 2"]

  Unnamed: 1  Unnamed: 2
3        AMD      5431.6
4     Etalon      4636.0
5   Infineon      2772.0

In [16]:
t = t.rename(
        columns={
            "Unnamed: 1": "Asset",
            "Unnamed: 2": "Value",
        } )

In [17]:
# filters
tcut = t[  (t["Value"]>10000) & 
           (t["Value"]<50000) ]

In [18]:
# statistic
t.describe()

               Value
count      81.000000
mean    15887.217778
std     54719.150419
min         0.000000
25%      1072.800000
50%      3360.000000
75%      9788.000000
max    441275.880000

In [19]:
t.to_excel("assets.xlsx")